jojo240607/joc-base/src/hal/stm32/test/rtos_irq.c
#include "rtos.h"
#include "rtos_mpu.h"      /* g_fault_cfsr / g_stack_overflow 故障/溢出粘性标志 */
#include "core/bh.h"       /* rtos_bh_task_create / rtos_bh_trigger */
#include "log/log.h"
#include "log/app_log.h"
#include "irq/irq.h"
#include "irq/irq_manager.h"
#ifdef STM32F103xx
#include "stm32f103xx.h"      /* TIM2/TIM5 / RCC / TIMx_IRQn / DWT */
#elif defined(STM32F407xx)
#include "stm32f4xx.h"      /* TIM5 / TIM2 / RCC / TIMx_IRQn / DWT */
#endif

#if defined(STM32F103xx) || defined(STM32F407xx)

#include <stdint.h>
#include <string.h>

/* ---------------------------------------------------------------------------
 * jOS 中断实时性 / 抗压自测（RTOSIRQ 命令，并注册进 RTOSALL "irq" 条目）。
 *
 * 覆盖此前测试场景里【缺失】的两个用户态关键场景：
 *
 *  (1) 实时中断响应：高优先级中断必须“零差错、零卡死”地响应。
 *        - 1a ISR(kernel prio) -> 高优先级任务(prio 3，高于 BH 带 4) 唤醒延迟；
 *        - 1b ISR(kernel prio) -> 下半部 BH 任务(prio 4) 唤醒延迟；
 *        - 1c 零延迟 ISR(prio 2, ZERO_LATENCY)：ISR 自身即做时关键工作，验证
 *              “绝对实时”——每个中断都立即得到服务(100% 交付, 从不丢/从不被屏蔽)、
 *              ISR 内处理有界(微秒级)。这是“高优先级中断任务”的硬实时保证。
 *        每个被延迟的响应都满足：中断数 <= 响应数(无丢失) 且 max 延迟 < 预算；
 *        结束后 tick 推进(绝不卡死)。
 *
 *  (2) 高频中断抗压：反复、长时间的高频中断不能把系统搞挂。
 *        - 2a TIM5 单路 ~50kHz 持续 5s，纯计数（验证中断机制在高频下不损坏、
 *             不重入死循环、系统存活）；
 *        - 2b TIM5(50kHz, prio5) + TIM2(30kHz, prio6) 双路嵌套并发 3s，验证
 *             中断嵌套 / 抢占下计数不丢、系统存活。
 *
 * 设计要点：
 *   - 中断频率远小于 ISR 处理耗时（ISR 仅清 UIF 标志 + 计数 / 发信号），故 UIF
 *     总能被及时清除，不会重入死循环冻板。
 *   - 每个用例结束都 disable + detach 对应定时器，避免与别处复用的 TIM2（ROBUST
 *     中断风暴）冲突；RTOSALL 顺序执行各条目，不存在并发持有同一定时器。
 *   - TIM5/TIM2 均在启动向量表指向 IRQ_CommonHandler，须经 irq_manager 注册回调
 *     分发（直接定义弱符号 TIMx_IRQHandler 无效，会空窗冻结板子）。
 *   - 零延迟 ISR(1c) 不调用任何内核 API（仅清标志 + 计数 + 读 DWT），符合
 *     FreeRTOS 式契约：prio < RTOS_MAX_ZERO_LATENCY_IRQS 阈值的 ISR 永不被内核
 *     临界区(BASEPRI)屏蔽，故“立即服务、零丢失”。
 * ------------------------------------------------------------------------- */

/* 延迟预算（延迟路径：ISR -> 被唤醒的任务/BH，依赖 PendSV，受临界区约束）：
 * 1ms @168MHz = 168000 周期。平均仅几 µs，worst-case 允许到 1ms（已剔除首 2 个
 * 冷启动样本）。零延迟 ISR(1c) 自身处理预算：20µs。 */
#define IRQ_WAKE_BUDGET_CYCLES (1000u * 168u)
#define IRQ_ZL_ISR_BUDGET_CYCLES (20u * 168u)

/* cycle -> µs（168MHz：168 周期 = 1µs；四舍五入） */
static uint32_t cyc_to_us(uint32_t c) { return (c + 84u) / 168u; }

/* 实际经历 cycles -> 期望中断数（rate 为 Hz；用 64 位避免溢出） */
static uint32_t exp_from_cycles(uint32_t rate_hz, uint32_t dc) {
    return (uint32_t)(((uint64_t)rate_hz * (uint64_t)dc) / 168000000ULL);
}

/* ---- 通用定时器启停（TIM5 / TIM2 共用，1MHz 计数时钟） ---- */
static void irq_timer_start(TIM_TypeDef *tim, uint32_t hz) {
#ifndef STM32F103xx
    if (tim == TIM5)      RCC->APB1ENR |= RCC_APB1ENR_TIM5EN;
    else
#endif
    if (tim == TIM2) RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;
    tim->CR1 = 0;
    tim->PSC = 83;                                  /* 84MHz / 84 = 1MHz */
    tim->ARR = (84000000u / 84u / hz) - 1u;         /* 达到 hz 溢出 */
    tim->DIER |= TIM_DIER_UIE;
    tim->CNT = 0; tim->SR = 0;
    tim->CR1 |= TIM_CR1_CEN;
}
static void irq_timer_stop(TIM_TypeDef *tim) {
    tim->CR1 &= ~TIM_CR1_CEN;
#ifndef STM32F103xx
    if (tim == TIM5)      RCC->APB1ENR &= ~RCC_APB1ENR_TIM5EN;
    else
#endif
    if (tim == TIM2) RCC->APB1ENR &= ~RCC_APB1ENR_TIM2EN;
}

/* ===================== 场景 1a：ISR -> 高优先级任务 唤醒延迟 ===================== */
static volatile uint32_t g_ia_t0;     /* ISR 到达 cycle */
static volatile uint32_t g_ia_irq;     /* ISR 计数 */
static volatile uint32_t g_ia_rsp;     /* 高优先级任务响应计数 */
static volatile uint32_t g_ia_max;     /* max 唤醒延迟(cycle) */
static volatile uint32_t g_ia_sum;     /* 累计延迟(cycle, 求均值) */
static volatile int       g_ia_run;
static volatile int       g_ia_active; /* 1=活跃风暴期(仅此期间统计延迟，剔除收尾样本) */
static rtos_sem_t         g_ia_sem;
RTOS_TASK_STACK(g_ia_stack, 1024);
static void ia_task(void *arg) {
    (void)arg;
    uint32_t n = 0;
    while (g_ia_run) {
        rtos_sem_wait(&g_ia_sem);
        uint32_t t1  = rtos_cycle_now();                 /* 任务被唤醒时刻 */
        uint32_t lat = (t1 > g_ia_t0) ? (t1 - g_ia_t0) : 0;
        g_ia_rsp++;
        /* 仅活跃风暴期内统计延迟：剔除首 2 个冷启动样本(首次 PendSV 预热)与
         * 收尾样本(定时器停后 g_ia_t0 已陈旧)，只反映稳态实时性。 */
        if (g_ia_active) {
            g_ia_sum += lat;
            if (n >= 2 && lat > g_ia_max) g_ia_max = lat;
        }
        n++;
    }
}
static void ia_isr(void *ctx) {
    (void)ctx;
#ifndef STM32F103xx
    if (TIM5->SR & TIM_SR_UIF) {
        TIM5->SR &= ~TIM_SR_UIF;          /* 清溢出，避免重入 */
        g_ia_t0  = rtos_cycle_now();      /* 到达时刻 */
        g_ia_irq++;
        rtos_sem_give(&g_ia_sem);         /* ISR 安全：唤醒高优先级任务 */
    }
#endif
}

/* ===================== 场景 1b：ISR -> 下半部 BH 任务 唤醒延迟 ===================== */
static volatile uint32_t g_ib_t0;
static volatile uint32_t g_ib_irq;
static volatile uint32_t g_ib_rsp;
static volatile uint32_t g_ib_max;
static volatile uint32_t g_ib_sum;
static bh_t              *g_ib_bh;
RTOS_TASK_STACK(g_ib_stack, 1024);
static void ib_bh_fn(void *arg) {
    (void)arg;
    uint32_t t1  = rtos_cycle_now();                       /* BH 任务被唤醒时刻 */
    uint32_t lat = (t1 > g_ib_t0) ? (t1 - g_ib_t0) : 0;
    g_ib_rsp++;
    g_ib_sum += lat;
    if (lat > g_ib_max) g_ib_max = lat;
}
static void ib_isr(void *ctx) {
    (void)ctx;
#ifndef STM32F103xx
    if (TIM5->SR & TIM_SR_UIF) {
        TIM5->SR &= ~TIM_SR_UIF;
        g_ib_t0 = rtos_cycle_now();
        g_ib_irq++;
        rtos_bh_trigger(g_ib_bh);        /* ISR 安全：触发 BH 任务 */
    }
#endif
}

/* ===================== 场景 1c：零延迟 ISR 硬实时（不调内核 API） =====================
 * 这是“高优先级中断任务”的硬实时保证：ISR 自身(prio 2, 永不被 BASEPRI 屏蔽)在中断
 * 发生的同一时刻被服务，每个中断 100% 交付、从不被丢失/延迟；ISR 内处理有界(µs)。 */
static volatile uint32_t g_ic_cnt;       /* ISR 计数（100% 交付证明） */
static volatile uint32_t g_ic_max;       /* ISR 内处理 max 延迟(cycle) */
static volatile uint32_t g_ic_sum;
static void ic_isr(void *ctx) {
    (void)ctx;
#ifndef STM32F103xx
    if (TIM5->SR & TIM_SR_UIF) {
        uint32_t t0 = rtos_cycle_now();      /* ISR 入口（中断发生后极短延迟） */
        TIM5->SR &= ~TIM_SR_UIF;             /* 清溢出（唯一关键工作） */
        g_ic_cnt++;
        uint32_t t1 = rtos_cycle_now();
        uint32_t lat = (t1 > t0) ? (t1 - t0) : 0;
        g_ic_sum += lat;
        if (lat > g_ic_max) g_ic_max = lat;
    }
#endif
}

/* ===================== 场景 1d（P1-2）：零延迟 ISR + kernel ISR 共存端到端延迟 =====================
 * 构造多级中断优先级共存：TIM5 零延迟 ISR(prio 2, 永不被 BASEPRI 屏蔽) 与 TIM2 kernel-prio
 * ISR(prio 5, 唤醒 prio 3 硬实时任务) 并发运行。验证：
 *  (a) 零延迟 ISR 100% 即时交付（不被 BASEPRI 阈值挡）；
 *  (b) kernel-prio ISR -> 任务唤醒延迟仍有界(< IRQ_WAKE_BUDGET_CYCLES)，证明 BASEPRI 阈值
 *      不挡零延迟 IRQ 的同时 kernel IRQ 最坏延迟有界。 */
static volatile uint32_t g_id_t0;     /* TIM2 ISR 到达 cycle */
static volatile uint32_t g_id_irq;
static volatile uint32_t g_id_rsp;
static volatile uint32_t g_id_max;
static volatile uint32_t g_id_sum;
static volatile int       g_id_run;
static volatile int       g_id_active;
static rtos_sem_t         g_id_sem;
static uint8_t g_id_stack[1024] __attribute__((aligned(8)));  /* 主 SRAM：CCM 已满，临时验收任务栈 */
static void id_task(void *arg) {
    (void)arg;
    uint32_t n = 0;
    while (g_id_run) {
        rtos_sem_wait(&g_id_sem);
        uint32_t t1  = rtos_cycle_now();
        uint32_t lat = (t1 > g_id_t0) ? (t1 - g_id_t0) : 0;
        g_id_rsp++;
        if (g_id_active) {
            g_id_sum += lat;
            if (n >= 2 && lat > g_id_max) g_id_max = lat;
        }
        n++;
    }
}
static void id_isr(void *ctx) {
    (void)ctx;
    if (TIM2->SR & TIM_SR_UIF) {
        TIM2->SR &= ~TIM_SR_UIF;
        g_id_t0  = rtos_cycle_now();
        g_id_irq++;
        rtos_sem_give(&g_id_sem);     /* ISR 安全：唤醒 prio 3 硬实时任务 */
    }
}

/* ===================== 场景 2a：单路高频风暴（TIM5 ~50kHz, 5s） ===================== */
static volatile uint32_t g_sa_cnt;
static void sa_isr(void *ctx) {
    (void)ctx;
#ifndef STM32F103xx
    if (TIM5->SR & TIM_SR_UIF) {
        TIM5->SR &= ~TIM_SR_UIF;
        g_sa_cnt++;                       /* 纯计数：最小化 ISR 开销 */
    }
#endif
}

/* ===================== 场景 2b：双路嵌套高频风暴（TIM5 + TIM2, 3s） ===================== */
static volatile uint32_t g_sb_cnt5;
static volatile uint32_t g_sb_cnt2;
static void sb_isr5(void *ctx) {
    (void)ctx;
#ifndef STM32F103xx
    if (TIM5->SR & TIM_SR_UIF) {
        TIM5->SR &= ~TIM_SR_UIF;
        g_sb_cnt5++;
    }
#endif
}
static void sb_isr2(void *ctx) {
    (void)ctx;
    if (TIM2->SR & TIM_SR_UIF) {
        TIM2->SR &= ~TIM_SR_UIF;
        g_sb_cnt2++;
    }
}

/* ---- 容差辅助：实测值落在 [exp*(1-tol), exp*(1+tol)] 内 ---- */
static int within(uint32_t got, uint32_t exp, uint32_t tol_pct) {
    if (exp == 0) return (got == 0);
    uint32_t lo = exp - (exp * tol_pct) / 100u;
    uint32_t hi = exp + (exp * tol_pct) / 100u;
    return (got >= lo && got <= hi);
}

int rtos_irq_selftest(void) {
#ifndef STM32F103xx
    int ok = 1;
    rtos_cycle_init();
    uint32_t fault0 = g_fault_cfsr;
    log_printf(app_log(), LOG_INFO, "rtos", "[IRQ] self-test begin\n");
    /* ---------- 场景 1a：ISR -> 高优先级任务(prio 3) 唤醒延迟 ---------- */
    {
        rtos_sem_init(&g_ia_sem, 0, 100000);
        g_ia_t0 = g_ia_irq = g_ia_rsp = g_ia_max = g_ia_sum = 0;
        g_ia_run = 1;
        g_ia_active = 0;
        rtos_task_create("irq_a", ia_task, (void *)0, 3, g_ia_stack, sizeof(g_ia_stack));
        irq_manager_attach((irq_id_t)TIM5_IRQn, ia_isr, NULL);
        irq_manager_set_priority((irq_id_t)TIM5_IRQn, IRQ_PRIO_KERNEL, IRQ_CLASS_KERNEL);
        irq_manager_enable((irq_id_t)TIM5_IRQn, ia_isr, NULL);
        uint32_t tk0 = rtos_tick_count();
        g_ia_active = 1;
        irq_timer_start(TIM5, 1000);
        rtos_msleep(2000);
        irq_timer_stop(TIM5);
        rtos_msleep(50);
        g_ia_active = 0;
        g_ia_run = 0;
        rtos_sem_give(&g_ia_sem);
        rtos_msleep(20);
        irq_manager_disable((irq_id_t)TIM5_IRQn, ia_isr, NULL);
        irq_manager_detach((irq_id_t)TIM5_IRQn, ia_isr, NULL);
        uint32_t max_us = cyc_to_us(g_ia_max);
        uint32_t avg_us = (g_ia_rsp > 0) ? cyc_to_us(g_ia_sum / g_ia_rsp) : 0;
        int lok = (g_ia_rsp >= g_ia_irq) && (g_ia_irq > 0) && (g_ia_max <= IRQ_WAKE_BUDGET_CYCLES) && (rtos_tick_count() > tk0);
        if (!lok) ok = 0;
        log_printf(app_log(), LOG_INFO, "rtos", "[IRQ] 1a ISR->hi-prio task: irq=%lu rsp=%lu max=%luus avg=%luus %s\n", (unsigned long)g_ia_irq, (unsigned long)g_ia_rsp, (unsigned long)max_us, (unsigned long)avg_us, lok ? "PASS" : "FAIL");
        RTOS_TEST_RESULT("IRQLatencyTask", lok);
    }
    log_printf(app_log(), LOG_INFO, "rtos", "[IRQ] self-test: %s\n", ok ? "PASS" : "FAIL");
    return ok;
#else
    (void)g_fault_cfsr;
    (void)g_stack_overflow;
    (void)cyc_to_us;
    (void)exp_from_cycles;
    (void)within;
    log_printf(app_log(), LOG_INFO, "rtos", "[IRQ] self-test: SKIP (no TIM5 on F103)\n");
    return 1;
#endif
}
/* TEMP-DISABLED for boot-crash bisection */ /* RTOS_SELFTEST_ADD("irq", rtos_irq_selftest); */
#else
/* H750 (and other non-F4/103): skip F4-specific timer-based IRQ tests */
int rtos_irq_selftest(void) { return 1; }
/* TEMP-DISABLED: RTOS_SELFTEST_ADD("irq", rtos_irq_selftest); */
#endif
